def main_menu():
    opt = 6
    print('---------------------')
    print('Телефонный справочник')
    print('---------------------')
    print('Выберите действие:\n'
          '1 - Просмотр всего справочника\n'
          '2 - Поиск элемент\n'
          '3 - Добавление/изменение элемента\n'
          '4 - Удаление элемента\n'
          '5 - Загрузка/выгрузка данных \n'
          '0 - Выход')
    return opt


def search_menu():
    print('--------------')
    print('Поиск абонента')
    print('--------------')


def edit_menu():
    print('----------------------')
    print('Работа со справочником')
    print('----------------------')
    print('Выберите действие:\n'
          '1 - Добавление абонента\n'
          '2 - Изменение данных абонента\n'
          '0 - Выход')


def delete_menu():
    print('-----------------')
    print('Удаление абонента')
    print('-----------------')


def file_menu():
    print('------------------------')
    print('Загрузка/выгрузка данных')
    print('------------------------')
    print('Выберите действие:\n'
          '1 - Загрузить из файла\n'
          '2 - Выгрузка в файл\n'
          '0 - Выход')


